src/cf/Catalogs/ИсходящиеСообщенияRabbitMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ИсходящиеСообщенияRabbitMQ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/RabbitMQ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьСообщения(ОбъектКонвертер) Экспорт
	НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	КоличествоЗаявок = 0;
	Кэш = Неопределено;
	
	Очереди = ОчередиДляПолученияСообщений();
	Для Каждого Очередь Из Очереди Цикл
		Пока Истина Цикл
			ТекстСообщения = ПолучитьСообщение(Очередь, Кэш);
			Если ТекстСообщения <> Неопределено Тогда
				ОбъектКонвертер.ПреобразоватьТекстСообщенияВОбъект(ТекстСообщения);
				КоличествоЗаявок = КоличествоЗаявок + 1;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ОбменДанными.ЗагрузитьДанные", НачалоЗамера, КоличествоЗаявок);
	
	Сообщить(СтрШаблон("Загружено заявок на изменение: %1", КоличествоЗаявок));
КонецПроцедуры

Процедура ДобавитьСообщениеКОтправке(ТекстСообщения, ДополнительныеПараметры) Экспорт
	КлючАналитики = ДополнительныеПараметры.ТипДанных;
	
	ПараметрыПодключения = РегистрыСведений.ПараметрыRabbitMQ.ЗначенияПараметров();
	КлючМаршрутизации = ПараметрыПодключения["КлючМаршрутизации"][КлючАналитики];
	
	Справочники.ИсходящиеСообщенияRabbitMQ.ДобавитьСообщение(КлючАналитики, ТекстСообщения, КлючМаршрутизации);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОтправкаСообщенийВRabbitMQОбработчикЗадания() Экспорт
	ОтправитьСообщения();
КонецПроцедуры

Процедура ОтправитьСообщения() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсходящиеСообщенияRabbitMQ.Ссылка КАК Ссылка,
	|	ИсходящиеСообщенияRabbitMQ.ТекстСообщения КАК ТекстСообщения,
	|	ИсходящиеСообщенияRabbitMQ.КлючМаршрутизации КАК КлючМаршрутизации
	|ИЗ
	|	Справочник.ИсходящиеСообщенияRabbitMQ КАК ИсходящиеСообщенияRabbitMQ
	|ГДЕ
	|	ИсходящиеСообщенияRabbitMQ.ДатаОтправки = &ПустаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсходящиеСообщенияRabbitMQ.ДатаСоздания";
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОтправитьСообщение(Выборка);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьСообщение(Сообщение) 
	ПараметрыСообщения = RabbitMQКлиентСервер.НовыеПараметрыИсходящегоСообщения();
	ПараметрыПодключения = РегистрыСведений.ПараметрыRabbitMQ.ЗначенияПараметров();
	ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ПараметрыПодключения);
	ПараметрыСообщения.КлючМаршрутизации = Сообщение.КлючМаршрутизации;
	
	ПараметрыСообщения.ТекстСообщения = Сообщение.ТекстСообщения;
	
	КлиентКомпоненты = ПолучитьКомпоненту();
	RabbitMQКлиентСервер.ОтправитьСообщение(КлиентКомпоненты, ПараметрыСообщения);
	
	СообщениеОбъект = Сообщение.Ссылка.ПолучитьОбъект();
	СообщениеОбъект.ДатаОтправки = ТекущаяДатаСеанса();
	СообщениеОбъект.Записать();
КонецПроцедуры

Функция ПолучитьАдресМакетаКомпановки(УникальныйИдентификатор) Экспорт
	
	МакетВнешнейКомпоненты    = Обработки.ПримерРаботыСКомпонентойPinkRabbitMQ.ПолучитьМакет("ВнешняяКомпонента");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МакетВнешнейКомпоненты, УникальныйИдентификатор);
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции

Функция ПолучитьСообщение(ИмяОчереди, КэшируемыеЗначения = Неопределено) Экспорт
	Если КэшируемыеЗначения = Неопределено Тогда
		КэшируемыеЗначения = Новый Структура;
	КонецЕсли;
	
	ПараметрыСообщения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КэшируемыеЗначения, "ПараметрыСообщения");
	Если ПараметрыСообщения = Неопределено Тогда
		ПараметрыСообщения = RabbitMQКлиентСервер.НовыеПараметрыВходящегоСообщения();
		ПараметрыПодключения = РегистрыСведений.ПараметрыRabbitMQ.ЗначенияПараметров();
		ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ПараметрыПодключения);
	КонецЕсли;
	ПараметрыСообщения.ИмяОчереди = ИмяОчереди;
	КлиентКомпоненты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КэшируемыеЗначения, "КлиентКомпоненты");
	Если КлиентКомпоненты = Неопределено Тогда
		КлиентКомпоненты = ПолучитьКомпоненту();
		КэшируемыеЗначения.Вставить("КлиентКомпоненты", КлиентКомпоненты);
	КонецЕсли;
	
	Сообщение = RabbitMQКлиентСервер.ПрочитатьСообщение(КлиентКомпоненты, ПараметрыСообщения);
	Возврат Сообщение;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОчередиДляПолученияСообщений()
	ЗначенияПараметров = РегистрыСведений.ПараметрыRabbitMQ.ЗначенияПараметров();
	Если ТипЗнч(ЗначенияПараметров.ИмяОчереди) = Тип("Массив") Тогда
		Очереди = ЗначенияПараметров.ИмяОчереди; 
	Иначе
		Очереди = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗначенияПараметров.ИмяОчереди); 
	КонецЕсли;
	Возврат Очереди;
КонецФункции

Функция ПолучитьКомпоненту()
	
	КлиентКомпоненты = Неопределено;
	Если Не RabbitMQКлиентСервер.ИнициализироватьКомпоненту(КлиентКомпоненты) Тогда
		
		ПодключитьКомпоненту();
		RabbitMQКлиентСервер.ИнициализироватьКомпоненту(КлиентКомпоненты);
		
	КонецЕсли;
	
	Возврат КлиентКомпоненты;
КонецФункции

Процедура ПодключитьКомпоненту(КомпонентаПодключена = Неопределено, ВыводитьСообщения = Ложь)
	
	АдресВоВременномХранилище = ПолучитьАдресМакетаКомпановки(Новый УникальныйИдентификатор);
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			АдресВоВременномХранилище,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
	Если ВыводитьСообщения Тогда
		Сообщить(НСтр("ru = 'Компонента подключена!'"));
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти
